ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/am243x/PSC0.xml
<module name="PSC0" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="VBUS_PID" acronym="VBUS_PID" offset="0x0" width="32" description="The peripheral identification register is a constant register that contains the ID and ID revision number for that module. The PID stores version information used to identify the module. All bits within this register are read-only (writes have no effect) meaning that the values within this register should be hard-coded with the appropriate values and must not change from their hard-coded values.">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="PID register scheme" range="31 - 30" rwaccess="R"/> 
		<bitfield id="BU" width="2" begin="29" end="28" resetval="0x0" description="Business Unit" range="29 - 28" rwaccess="R"/> 
		<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x1154" description="Module ID" range="27 - 16" rwaccess="R"/> 
		<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x0" description="RTL revision. Will vary depending on release" range="15 - 11" rwaccess="R"/> 
		<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x2" description="Major revision" range="10 - 8" rwaccess="R"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom" range="7 - 6" rwaccess="R"/> 
		<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x0" description="Minor revision" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="VBUS_GBLCTL" acronym="VBUS_GBLCTL" offset="0x10" width="32" description="This register contains global control to PSC.">
		<bitfield id="IO_ANA_CTL" width="8" begin="15" end="8" resetval="0x0" description="General purpose IO/Analog PowerDown control. Directly drives io_ana_pdctl_po[7:0] outputs." range="15 - 8" rwaccess="R"/>
	</register>
	<register id="VBUS_GBLSTAT" acronym="VBUS_GBLSTAT" offset="0x14" width="32" description="This register shows the PSC global status.">
		<bitfield id="EF_SMRFLEX" width="12" begin="27" end="16" resetval="0x0" description="Smart reflex class0 bits" range="27 - 16" rwaccess="R"/> 
		<bitfield id="OVRIDE" width="1" begin="0" end="0" resetval="0x0" description="PSC Override Status" range="0" rwaccess="R"/>
	</register>
	<register id="VBUS_INTEVAL" acronym="VBUS_INTEVAL" offset="0x18" width="32" description="This register has no storage. Read from this register returns 0.">
		<bitfield id="GOSET" width="1" begin="19" end="19" resetval="0x0" description="GOSTAT Interrupt Set" range="19" rwaccess="W"/> 
		<bitfield id="EPCSET" width="1" begin="18" end="18" resetval="0x0" description="External Power Control Interrupt Set" range="18" rwaccess="W"/> 
		<bitfield id="ERRSET" width="1" begin="17" end="17" resetval="0x0" description="Combined Interrupt Set" range="17" rwaccess="W"/> 
		<bitfield id="EPCEV" width="1" begin="2" end="2" resetval="0x0" description="External Power Control Interrupt Set" range="2" rwaccess="W"/> 
		<bitfield id="ERREV" width="1" begin="1" end="1" resetval="0x0" description="Re_evaluate Error Interrupt" range="1" rwaccess="W"/> 
		<bitfield id="ALLEV" width="1" begin="0" end="0" resetval="0x0" description="Re_evaluate combined PSC interrupt" range="0" rwaccess="W"/>
	</register>
	<register id="VBUS_MERRPR" acronym="VBUS_MERRPR" offset="0x40" width="32" description="This register records pending error conditions for all modules. Each bit represents one module (index 0 for modules 0-31, index 1 for modules 32-63, etc.).">
		<bitfield id="M" width="32" begin="31" end="0" resetval="0x0" description="Records pending error conditions. Each bit n represents a module." range="31 - 0" rwaccess="R"/>
	</register>
	<register id="VBUS_MERRCR" acronym="VBUS_MERRCR" offset="0x50" width="32" description="This register has no storage. Read from this register returns 0. Each bit represents one module (index 0 for modules 0-31, index 1 for modules 32-63, etc.).">
		<bitfield id="M" width="32" begin="31" end="0" resetval="0x0" description="Write of 1 clears the corresponding MERRPR bit." range="31 - 0" rwaccess="W1TC"/>
	</register>
	<register id="VBUS_PERRPR" acronym="VBUS_PERRPR" offset="0x60" width="32" description="This register records pending error conditions for each power domain. Each bit represents one domain (index 0 for domains 0-31, index 1 for domains 32-63, etc.).">
		<bitfield id="P" width="32" begin="31" end="0" resetval="0x0" description="Power Domain n Error Condition. Each bit n represents a power domain." range="31 - 0" rwaccess="R"/>
	</register>
	<register id="VBUS_PERRCR" acronym="VBUS_PERRCR" offset="0x68" width="32" description="This register has no storage. Read from this register returns 0. Each bit represents one domain (index 0 for domains 0-31, index 1 for domains 32-63, etc.).">
		<bitfield id="P" width="32" begin="31" end="0" resetval="0x0" description="Write of 1 clears the corresponding PERRPR bit." range="31 - 0" rwaccess="W1TC"/>
	</register>
	<register id="VBUS_EPCPR" acronym="VBUS_EPCPR" offset="0x70" width="32" description="This register records pending external power control conditions. Each bit represents one domain (index 0 for domains 0-31, index 1 for domains 32-63, etc.).">
		<bitfield id="EPC" width="32" begin="31" end="0" resetval="0x0" description="External Power Control Intervention Request for Power Domain n" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="VBUS_EPCCR" acronym="VBUS_EPCCR" offset="0x78" width="32" description="This register has no storage. Read from this register returns 0. Each bit represents one domain (index 0 for domains 0-31, index 1 for domains 32-63, etc.).">
		<bitfield id="EPC" width="32" begin="31" end="0" resetval="0x0" description="Write of 1 clears the corresponding EPCPR bit" range="31 - 0" rwaccess="W1TC"/>
	</register>
	<register id="VBUS_RAILSTAT" acronym="VBUS_RAILSTAT" offset="0x100" width="32" description="This register is a read-only and shows the current rail requestor whose request is being granted and the current value of the counter associated with this requestor.">
		<bitfield id="RAILNUM" width="5" begin="28" end="24" resetval="0x0" description="Indicates Current Rail Requestor being processed by GPSC" range="28 - 24" rwaccess="R"/> 
		<bitfield id="RAILCNT" width="8" begin="7" end="0" resetval="0x0" description="Indicates the current rail counter value" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="VBUS_RAILCTL" acronym="VBUS_RAILCTL" offset="0x104" width="32" description="This register is user programmable. It holds the counter values for rail counter. User can select one of the two counter values to be used for each power domain (see RAILSEL register).">
		<bitfield id="RAILCTR1" width="8" begin="15" end="8" resetval="0x0" description="Rail Counter Value 1" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="RAILCTR0" width="8" begin="7" end="0" resetval="0x0" description="Rail Counter Value 0" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="VBUS_RAILSEL" acronym="VBUS_RAILSEL" offset="0x108" width="32" description="User can use this register to select the counter value (RAILCTL) for each power domain.">
		<bitfield id="P" width="32" begin="31" end="0" resetval="0x0" description="Rail Counter Select for Power Domain" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="VBUS_PTCMD" acronym="VBUS_PTCMD" offset="0x120" width="32" description="This is a pseudo-command register with no actual storage. Reads return 0. One bit for each power domain (index 0 for domains 0-31, index 1 for domains 32-63, etc.).">
		<bitfield id="GO" width="32" begin="31" end="0" resetval="0x0" description="Power Domain n GO Transition" range="31 - 0" rwaccess="W1TS"/>
	</register>
	<register id="VBUS_PTSTAT" acronym="VBUS_PTSTAT" offset="0x128" width="32" description="This is a status register. One bit for each power domain (index 0 for domains 0-31, index 1 for domains 32-63, etc.).">
		<bitfield id="GOSTAT" width="32" begin="31" end="0" resetval="0x0" description="Power Domain n Transition Command Status" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="VBUS_PDSTAT" acronym="VBUS_PDSTAT" offset="0x200" width="32" description="This is a status register. One register per power domain. Each register contains the status for the given power domain.">
		<bitfield id="EMUIHB" width="1" begin="11" end="11" resetval="0x0" description="Emulation Alters Domain State" range="11" rwaccess="R"/> 
		<bitfield id="PWRBAD" width="1" begin="10" end="10" resetval="0x0" description="Power Bad error" range="10" rwaccess="R"/> 
		<bitfield id="PORDONE" width="1" begin="9" end="9" resetval="0x0" description="POR Done  Input Status" range="9" rwaccess="R"/> 
		<bitfield id="PORZ" width="1" begin="8" end="8" resetval="0x0" description="PORz output actual status" range="8" rwaccess="R"/> 
		<bitfield id="STATE" width="5" begin="4" end="0" resetval="0x0" description="Current Power Domain State" range="4 - 0" rwaccess="R"/>
	</register>
	<register id="VBUS_PDCTL" acronym="VBUS_PDCTL" offset="0x300" width="32" description="This is a control register. One register per power domain.">
		<bitfield id="FORCE" width="1" begin="31" end="31" resetval="0x0" description="Force Bit" range="31" rwaccess="R/W"/> 
		<bitfield id="PWRSW" width="1" begin="29" end="29" resetval="0x0" description="Power shorting Switch Control" range="29" rwaccess="R/W"/> 
		<bitfield id="ISO" width="1" begin="28" end="28" resetval="0x0" description="Isolation Cell control" range="28" rwaccess="R/W"/> 
		<bitfield id="WAKECNT" width="8" begin="23" end="16" resetval="0x0" description="RAM wake count delay value" range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="PDMODE" width="3" begin="14" end="12" resetval="0x0" description="Power Down mode" range="14 - 12" rwaccess="R/W"/> 
		<bitfield id="EMUIHBIE" width="1" begin="9" end="9" resetval="0x0" description="Emulation alters domain state" range="9" rwaccess="R/W"/> 
		<bitfield id="EPCGOOD" width="1" begin="8" end="8" resetval="0x0" description="External Power Control Power Good Indication" range="8" rwaccess="R/W"/> 
		<bitfield id="NEXT" width="1" begin="0" end="0" resetval="0x0" description="User_Desired Next Power Domain State" range="0" rwaccess="R/W"/>
	</register>
	<register id="VBUS_PDCFG" acronym="VBUS_PDCFG" offset="0x400" width="32" description="This is a status register. It shows PSC settings for easy debug.">
		<bitfield id="ICEPICK" width="1" begin="3" end="3" resetval="0x0" description="Icepick support" range="3" rwaccess="R"/> 
		<bitfield id="MEMSLPKWK" width="1" begin="1" end="1" resetval="0x0" description="Memory sleep-wake domain" range="1" rwaccess="R"/> 
		<bitfield id="ALWAYSON" width="1" begin="0" end="0" resetval="0x0" description="Always on power domain" range="0" rwaccess="R"/>
	</register>
	<register id="VBUS_MDCFG" acronym="VBUS_MDCFG" offset="0x600" width="32" description="This is a constant register showing some PSC settings for easy debug. This register is read only.">
		<bitfield id="PWRDOM" width="5" begin="20" end="16" resetval="0x0" description="Indicates which power domain this module belongs to" range="20 - 16" rwaccess="R"/> 
		<bitfield id="AUTOONLY" width="1" begin="15" end="15" resetval="0x0" description="0: This LPSC supports all modes, 1: This LPSC supports Enable, AutoSleep or AutoWake only" range="15" rwaccess="R"/> 
		<bitfield id="RESETISO" width="1" begin="14" end="14" resetval="0x0" description="0: This LPSC does not support Reset Isolation, 1: This LPSC supports Reset Isolation" range="14" rwaccess="R"/> 
		<bitfield id="NEXTLOCK" width="1" begin="13" end="13" resetval="0x0" description="0: MDCTL.NEXT field is writable, 1: MDCTL.NEXT field is locked" range="13" rwaccess="R"/> 
		<bitfield id="ASYNC" width="1" begin="12" end="12" resetval="0x0" description="Async Lpsc" range="12" rwaccess="R"/> 
		<bitfield id="ICEPICK" width="1" begin="11" end="11" resetval="0x0" description="IcePick support" range="11" rwaccess="R"/> 
		<bitfield id="PERMDIS" width="1" begin="10" end="10" resetval="0x0" description="Permanently disable" range="10" rwaccess="R"/> 
		<bitfield id="PLLHANDSHAKE" width="1" begin="9" end="9" resetval="0x0" description="RTL parameter PLL_HANDSHAKE" range="9" rwaccess="R"/> 
		<bitfield id="NUMSCRDISBALE" width="3" begin="8" end="6" resetval="0x0" description="Number of PWR_SCR_DISABLE interfaces required on LPSC" range="8 - 6" rwaccess="R"/> 
		<bitfield id="NUMCLKEN" width="3" begin="5" end="3" resetval="0x0" description="Number of PWR_CLK_EN interfaces required on LPSC" range="5 - 3" rwaccess="R"/> 
		<bitfield id="NUMCLK" width="3" begin="2" end="0" resetval="0x0" description="Number of PWR_CLKSTOP interfaces required on LPSC" range="2 - 0" rwaccess="R"/>
	</register>
	<register id="VBUS_MDSTAT" acronym="VBUS_MDSTAT" offset="0x800" width="32" description="This register shows the status of each module. Requires one register per module on the device.">
		<bitfield id="EMUIHB" width="1" begin="17" end="17" resetval="0x0" description="Emulation Alters Module State. Inhibits Module Inactive or Force Module Active." range="17" rwaccess="R"/> 
		<bitfield id="EMURST" width="1" begin="16" end="16" resetval="0x0" description="Emulation Alters Reset" range="16" rwaccess="R"/> 
		<bitfield id="MCKOUT" width="1" begin="12" end="12" resetval="0x0" description="Actual modclk output to module" range="12" rwaccess="R"/> 
		<bitfield id="MRSTDONE" width="1" begin="11" end="11" resetval="0x0" description="Module reset initialization done status" range="11" rwaccess="R"/> 
		<bitfield id="MRSTZ" width="1" begin="10" end="10" resetval="0x0" description="Module reset actual status" range="10" rwaccess="R"/> 
		<bitfield id="LRSTDONE" width="1" begin="9" end="9" resetval="0x0" description="Module local reset initialization done status" range="9" rwaccess="R"/> 
		<bitfield id="LRSTZ" width="1" begin="8" end="8" resetval="0x0" description="Module local reset actual status" range="8" rwaccess="R"/> 
		<bitfield id="STATE" width="6" begin="5" end="0" resetval="0x0" description="These bits indicate the current module state" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="VBUS_MDCTL" acronym="VBUS_MDCTL" offset="0xA00" width="32" description="This register provides specific control for the individual module. One register per module on the device.">
		<bitfield id="FORCE" width="1" begin="31" end="31" resetval="0x0" description="Force Bit" range="31" rwaccess="R/W"/> 
		<bitfield id="RESETISO" width="1" begin="12" end="12" resetval="0x0" description="Reset Isolation" range="12" rwaccess="R/W"/> 
		<bitfield id="BLKCHIP1RST" width="1" begin="11" end="11" resetval="0x0" description="Block Chip_1_Reset" range="11" rwaccess="R/W"/> 
		<bitfield id="EMUIHBIE" width="1" begin="10" end="10" resetval="0x0" description="Emulation Alters Module State. Inhibits Module Inactive or Force Module Active." range="10" rwaccess="R/W"/> 
		<bitfield id="EMURSTIE" width="1" begin="9" end="9" resetval="0x0" description="Emulation Alter Reset Interrupt Enable" range="9" rwaccess="R/W"/> 
		<bitfield id="LRSTZ" width="1" begin="8" end="8" resetval="0x0" description="Module local reset control" range="8" rwaccess="R/W"/> 
		<bitfield id="NEXT" width="5" begin="4" end="0" resetval="0x0" description="Module Next State" range="4 - 0" rwaccess="R/W"/>
	</register>
</module>